SpenceKonde/ATTinyCore/avr/cores/tiny/wiring.c
  #if (CLOCK_SOURCE==6) //handle weird frequencies when using the PLL clock
    #if (defined(BOOTTUNED165)) // If it's a micronucleus board, it will either run at 16.5 after
      // adjusting the internal oscillator for that speed (in which case we are done) or we want
      // it to be set to run at 16, in which case we need to reload the factory cal.
      #if (F_CPU!=16500000L) //if not 16.5, it's 16, or that divided by power of two
        OSCCAL = read_factory_calibration(); //we do this if it was tuned by micronucleus, but we don't want USB.
        #if (F_CPU!=16000000) // 16MHz is speed of unprescaled PLL clock - if we don't want that...
          #ifdef CCP
            CCP=0xD8; //enable change of protected register
          #else
            CLKPR=1<<CLKPCE; //enable change of protected register
          #endif
          #if (F_CPU ==8000000L)
            CLKPR=1; //prescale by 2 for 8MHz
          #elif (F_CPU==4000000L)
            CLKPR=2; //prescale by 4 for 4MHz
          #elif (F_CPU==2000000L)
            CLKPR=3; //prescale by 8 for 2MHz
          #elif (F_CPU==1000000L)
            CLKPR=4; //prescale by 16 for 1MHz
          #elif (F_CPU ==500000L)
            CLKPR=5; //prescale by 32 for 0.5MHz
          #elif (F_CPU ==250000L) // these extremely slow speeds are of questionable value.
            CLKPR=6; //prescale by 64 for 0.25MHz
          #elif (F_CPU ==125000L) //
            CLKPR=7; //prescale by 128 for 125kHz
          #elif (F_CPU ==62500L)
            CLKPR=8; //prescale by 256 for 62.50kHz
          #else
            #error "Frequency requested from PLL that cannot be generated by prescaling"
            #error "Custom tuning is not supported in the current version of ATTinyCore"
          #endif // end check for each prescale freq
        #endif //end if not 16
      #endif // end if not 16.5
    #elif (F_CPU == 16500000L) // not pretuned to 16.5 (no micronucleus), but 16.5 requested, presumably for VUSB.
      if (OSCCAL == read_factory_calibration()) {
        // adjust the calibration up from 16.0mhz to 16.5mhz
        if (OSCCAL >= 128) {
          // maybe 8 is better? oh well - only about 0.3% out anyway
          OSCCAL += 7;
        } else {
          OSCCAL += 5;
        }
      }
    #else // We're using PLL, and it's not a VUSB special case.
      #if (F_CPU!=16000000) // 16MHz is speed of unprescaled PLL clock.
        #ifdef CCP
          CCP=0xD8; //enable change of protected register
        #else
          CLKPR=1<<CLKPCE; //enable change of protected register
        #endif
        // One really wonders why someone would use the PLL as clock source if they weren't using VUSB or running at 16MHz, it's got to burn more power...
        #if (F_CPU ==8000000L)
          CLKPR=1; //prescale by 2 for 8MHz
        #elif (F_CPU==4000000L)
          CLKPR=2; //prescale by 4 for 4MHz
        #elif (F_CPU==2000000L)
          CLKPR=3; //prescale by 8 for 2MHz
        #elif (F_CPU==1000000L)
          CLKPR=4; //prescale by 16 for 1MHz
        #elif (F_CPU ==500000L)
          CLKPR=5; //prescale by 32 for 0.5MHz
        #elif (F_CPU ==250000L) // these extremely slow speeds are of questionable value.
          CLKPR=6; //prescale by 64 for 0.25MHz
        #elif (F_CPU ==125000L) //
          CLKPR=7; //prescale by 128 for 125kHz
        #elif (F_CPU ==62500L)
          CLKPR=8; //prescale by 256 for 62.50kHz
        #else
          #error "Frequency requested from PLL that cannot be generated by prescaling"
          #error "Custom tuning is not supported in the current version of ATTinyCore"
        #endif //end handling of individual frequencies
      #endif //end if not 16 MHz (default speed)
    #endif // end check for VUSB-related special cases
  #elif (CLOCK_SOURCE==0 && F_CPU!=8000000L && F_CPU!=1000000L)
    // normal oscillator, we want a setting that fuses won't give us,
    // so need to set prescale.
    #ifdef CCP
      CCP=0xD8; //enable change of protected register
    #else
      CLKPR=1<<CLKPCE; //enable change of protected register
    #endif
    #if (F_CPU ==4000000L)
      CLKPR=1; //prescale by 2 for 4MHz
    #elif (F_CPU ==2000000L)
      CLKPR=2; //prescale by 4 for 2MHz
      // 1 MHz handled by fuse
    #elif (F_CPU ==500000L) // these extremely slow speeds are of questionable value.
      CLKPR=4; //prescale by 16 for 0.5MHz
    #elif (F_CPU ==250000L)
      CLKPR=5; //prescale by 32 for 0.25MHz
    #elif (F_CPU ==125000L) //
      CLKPR=6; //prescale by 64 for 125kHz
    #elif (F_CPU ==62500L)
      CLKPR=7; //prescale by 128 for 62.50kHz
    #elif (F_CPU ==31250L)
      CLKPR=8; //prescale by 256 for 31.25kHz
    #else
      #error "Frequency requested from internal oscillator that cannot be generated by prescaling"
      #error "Custom tuning is not supported in the current version of ATTinyCore"
    #endif
  #elif(CLOCK_SOURCE==17 || CLOCK_SOURCE==18) // external 16MHz CLOCK or Crystal, but maybe they want to go slower to save power...
    #if (F_CPU!=16000000) // 16MHz is speed of external clock on these
      #ifdef CCP
        CCP=0xD8; //enable change of protected register
      #else
        CLKPR=1<<CLKPCE; //enable change of protected register
      #endif
      #if (F_CPU ==8000000L)
        CLKPR=1; //prescale by 2 for 8MHz
      #elif (F_CPU==4000000L)
        CLKPR=2; //prescale by 4 for 4MHz
      #elif (F_CPU==2000000L)
        CLKPR=3; //prescale by 8 for 2MHz
      #elif (F_CPU==1000000L)
        CLKPR=4; //prescale by 16 for 1MHz
      #elif (F_CPU ==500000L)
        CLKPR=5; //prescale by 32 for 0.5MHz
      #elif (F_CPU ==250000L) // these extremely slow speeds are of questionable value.
        CLKPR=6; //prescale by 64 for 0.25MHz
      #elif (F_CPU ==125000L) //
        CLKPR=7; //prescale by 128 for 125kHz
      #elif (F_CPU ==62500L)
        CLKPR=8; //prescale by 256 for 62.50kHz
      #else
        #error "Frequency requested from 16MHz external clock that cannot be generated by prescaling"
      #endif //end handling of individual frequencies
    #endif //end if not 16 MHz (default speed)
  #endif //end handling for the two types of internal oscillator derived clock source and 16MHz ext clock of MH-ET tiny88

